def get_type(tags):
    data = dict()
    data[1] = ["交通", "运输", "车", "船", "飞机", "路", "机场", "轨", "轮胎", "沥青","飞行"]
    data[2] = ["产业", "技术", "厂", "金属", "焊接", "工业的", "机械","火", "金属", "工具", "铁锤", "刀","工业","砖"]
    data[3] = ["人物", "儿童", "宝贝", "人", "孩", "男", "女", "婴儿", "拥抱", "怀孕", "新娘", "夫妇", "婚礼", " 浪漫",
               "跳舞", "结婚", "新郎", "奶奶", "祖母", "手","娃"]
    data[4] = ["动物", "猫","蚂蚁","鼠","狗","蜻蜓","鹳","鹅","狮", "虫","熊","猪","鸽", "鹦鹉","大象","老鼠","企鹅", "鸟","猛禽", "鹰","蟹", "宠物", "鱼", "鸡", "马", "驴", "羊","蝴蝶", "蜂巢","鹫","蜂","苍蝇", "鬣蜥","蜘蛛","虾","鹿","蛇","牛","鸭"]
    data[5] = ["医学", "健康", "医", "护士"]
    data[6] = ["商业", "金融", "办公", "公司", "娱乐", "工作", "网络", "会议", "服装", "领带", "领带", "衣服", "带", "商",
               "钱", "美元", "银行", "收入", "工资", "现金","硬币","财"]
    data[7] = ["地点", "伦敦", "地标", "雕像", "约克", "纽约", "美国", "曼联", "加拿大", "圣彼得堡", "法国", "澳大利亚",
               "奥地利", "新加坡", "金字塔", "新西兰", "德里", "印度", "德国", "坐"]
    data[8] = ["宗教", "佛", "基督", "圣诞", "教堂"]
    data[9] = ["建筑", "楼", "房屋", "家", "房", "城市", "几何", "街", "门"]
    data[10] = ["教育", "学习", "书", "纸", "笔", "黑板", "学","阅读","插图"]
    data[11] = ["旅游", "度假", "旅行", "山", "湖", "木", "草", "海", "沙滩", "雪", "景", "水", "日落", "黄昏", "天空",
                "田", "夏天", "山村", "村庄", "花", "酒店", "秋天", "户外", "苔藓", "放松", "清闲", "照相机","热气球","桂林", "漓江","公园"]
    data[12] = ["科学", "技术", "电", "冰箱", "安卓", "机器人", "手机", "智能", "苹果", "机器", "设备", "装置", "音频", "相机"]
    data[13] = ["美妆", "时尚", "艺术"]
    data[14] = ["背景", "花纹", "色"]
    data[15] = ["自然", "景", "树", "分支", "植物", "森林", "雨", "岛", "溪", "石", "月亮", "云", "星星", "星座", "池塘",
                "露营", "太阳","叶苗","瀑布","玫瑰","河","行星","叶","地球","植被","蒲公英"]
    data[16] = ["表情", "笑","脸"]
    data[17] = ["计算", "电脑","键盘", "沟通","Google","宇航","硬盘驱动器" ,"硬盘", "存储" ,"数字","直升机"]
    data[18] = ["运动", "足球"]
    data[19] = ["音乐", "音符", "舞蹈", "舞曲","吉他"]
    data[20] = ["食物", "食品", "饮料", "菜", "面", "包", "粥", "汤", "点心", "喝", "甜点", "零食", "饼干", "咖啡" "杯子",
                "豆", "咖啡", "星巴克", "豆",
                "馅饼", "谷物", "樱桃", "浆果", "甜点", "蛋挞", "油", "蛋", "糕", "餐", "香肠", "烧烤", "烧烤", "牛排",
                "肉", "茄子", "小麦", "玉米", "辣椒","葡萄","香蕉","可乐","寿司","巧克力","酒","南瓜","农业","瓜","蘑菇"]

    type = 0
    ans_len = 0
    for item in data:
        for item2 in data[item]:
            if tags.find(item2) != -1:
                if len(item2) > ans_len:
                    ans_len = len(item2)
                    type = item

    if ans_len == 0:
        for item in data:
            str = "".join(data[item])
            for word in str:
                if tags.find(word) != -1:
                    return item
        return False
    else:
        return type


if __name__ == "__main__":
    type = get_type("西")
    print(type)
